{
  "engagement_id": "ENG-7A3F2B01",
  "name": "QuickLend Pro Annual IT Audit FY2025",
  "client": "QuickLend Pro Inc.",
  "lead_auditor": "Maria Chen, CISA, CRISC",
  "audit_team": [
    "Maria Chen, CISA, CRISC",
    "David Park, CISSP",
    "Sarah Thompson, CISM"
  ],
  "status": "reporting",
  "scope_description": "Comprehensive IT audit of the QuickLend Pro digital lending platform covering application infrastructure, data security controls, and regulatory compliance. The platform processes approximately 50,000 loan applications per month and handles sensitive financial data including SSNs, bank account numbers, and credit reports. Infrastructure includes hybrid cloud deployment with on-premises Oracle database servers and AWS-hosted application tier.",
  "objectives": [
    "Evaluate the design and operating effectiveness of IT general controls across the lending platform",
    "Assess compliance with PCI-DSS v4.0 requirements for cardholder data protection",
    "Evaluate access control mechanisms protecting sensitive borrower data",
    "Review change management processes for platform stability and integrity",
    "Assess backup and disaster recovery readiness for business continuity",
    "Identify control deficiencies and provide actionable remediation recommendations"
  ],
  "methodology": "Risk-based audit approach aligned with ISACA IT Audit Framework. Control testing included inquiry, observation, inspection of documentation, and re-performance of selected controls. Sampling methodology followed ISACA guidance with sample sizes based on population and control frequency.",
  "start_date": "2025-10-01",
  "end_date": "2025-12-15",
  "report_date": "2025-12-20",
  "created_at": "2025-09-15T09:00:00",
  "updated_at": "2025-12-20T16:30:00",
  "overall_risk_score": 9.4,
  "overall_compliance_pct": 68.5,
  "executive_summary": "The audit identified several significant control deficiencies requiring management attention. While the organization has established foundational IT controls, gaps exist in privileged access management, change management segregation, and disaster recovery testing. Seven findings were identified, including two rated as critical severity related to shared service account credentials and lack of multi-factor authentication on administrative accounts. Immediate remediation of critical findings is recommended.",
  "notes": "Client was cooperative throughout the audit. IT team provided requested evidence within agreed-upon timelines. Follow-up audit recommended for Q2 2026 to validate remediation.",
  "audit_areas": [
    {
      "name": "Access Control",
      "description": "Controls for identity management, authentication, authorization, and access monitoring.",
      "status": "completed",
      "auditor_assigned": "Maria Chen, CISA, CRISC",
      "start_date": "2025-10-07",
      "completion_date": "2025-11-01",
      "compliance_pct": 62.5,
      "risk_score": 11.2,
      "notes": "Significant gaps identified in privileged access management and MFA enforcement.",
      "controls": [
        {
          "control_id": "AC-001",
          "title": "User Account Provisioning Process",
          "description": "Verify that a formal, documented process exists for provisioning user accounts.",
          "test_procedure": "1. Obtain the user provisioning policy/procedure document. 2. Select a sample of 25 user accounts created in the past 6 months. 3. For each sampled account, verify that an approved access request exists.",
          "expected_evidence": "User provisioning policy document, sample access request forms with approvals",
          "framework_mapping": {"ISO 27001": "A.5.16", "COBIT": "DSS05.04", "PCI-DSS": "7.2"},
          "risk_weight": 5,
          "status": "effective",
          "auditor_notes": "Formal provisioning process in place using ServiceNow. All 25 sampled accounts had approved access requests. Process well-documented and followed consistently.",
          "evidence_refs": ["EVD-001", "EVD-002"],
          "tested_date": "2025-10-10",
          "tested_by": "Maria Chen, CISA, CRISC"
        },
        {
          "control_id": "AC-002",
          "title": "User Account De-Provisioning (Termination)",
          "description": "Verify that user accounts are disabled or removed promptly when an employee is terminated.",
          "test_procedure": "1. Obtain a list of employees terminated in the past 6 months from HR. 2. Cross-reference against active accounts.",
          "expected_evidence": "HR termination list, Active Directory disable date reports",
          "framework_mapping": {"ISO 27001": "A.5.18", "COBIT": "DSS05.04", "PCI-DSS": "8.1.3"},
          "risk_weight": 5,
          "status": "partially_effective",
          "auditor_notes": "3 of 25 sampled terminated users had accounts active for more than 5 business days post-termination. HR notification process has a manual step that occasionally delays IT notification. Average de-provisioning time was 2.8 days; however, outliers reached 8 days.",
          "evidence_refs": ["EVD-003", "EVD-004"],
          "tested_date": "2025-10-12",
          "tested_by": "Maria Chen, CISA, CRISC"
        },
        {
          "control_id": "AC-003",
          "title": "Password Policy Enforcement",
          "description": "Verify that password policies enforce minimum complexity, length, and rotation requirements.",
          "test_procedure": "1. Review the documented password policy. 2. Extract Active Directory password policy settings.",
          "expected_evidence": "Password policy document, Active Directory Group Policy settings",
          "framework_mapping": {"ISO 27001": "A.5.17", "COBIT": "DSS05.04", "PCI-DSS": "8.3.6"},
          "risk_weight": 4,
          "status": "effective",
          "auditor_notes": "Password policy requires minimum 14 characters, complexity enabled, 90-day rotation, 24 password history. Account lockout after 5 failed attempts with 30-minute lockout duration. Meets or exceeds all framework requirements.",
          "evidence_refs": ["EVD-005"],
          "tested_date": "2025-10-14",
          "tested_by": "David Park, CISSP"
        },
        {
          "control_id": "AC-004",
          "title": "Multi-Factor Authentication (MFA)",
          "description": "Verify that multi-factor authentication is enforced for all remote access and privileged accounts.",
          "test_procedure": "1. Obtain MFA policy. 2. Test VPN login for MFA. 3. Test admin console login for MFA.",
          "expected_evidence": "MFA policy, enrollment statistics, VPN configuration",
          "framework_mapping": {"ISO 27001": "A.5.17", "COBIT": "DSS05.04", "PCI-DSS": "8.4"},
          "risk_weight": 5,
          "status": "ineffective",
          "auditor_notes": "MFA is enforced for VPN access and general user SSO. However, 12 domain administrator accounts and 8 database administrator accounts do not have MFA enabled. Legacy RADIUS authentication on the Oracle database management console allows password-only access. This represents a critical gap for privileged access.",
          "evidence_refs": ["EVD-006", "EVD-007"],
          "tested_date": "2025-10-16",
          "tested_by": "David Park, CISSP"
        },
        {
          "control_id": "AC-005",
          "title": "Privileged Access Management (PAM)",
          "description": "Verify that privileged accounts are subject to enhanced controls.",
          "test_procedure": "1. Obtain a complete list of all privileged accounts. 2. Verify business justification and named owner.",
          "expected_evidence": "Privileged account inventory, PAM tool reports",
          "framework_mapping": {"ISO 27001": "A.8.2", "COBIT": "DSS05.04", "PCI-DSS": "7.2.2"},
          "risk_weight": 5,
          "status": "ineffective",
          "auditor_notes": "No dedicated PAM solution deployed. Privileged credentials are stored in a shared spreadsheet (encrypted but not access-controlled). Three production service accounts share the same password which has not been rotated in 14 months. No session recording for privileged access.",
          "evidence_refs": ["EVD-008", "EVD-009"],
          "tested_date": "2025-10-18",
          "tested_by": "Maria Chen, CISA, CRISC"
        },
        {
          "control_id": "AC-006",
          "title": "Periodic Access Reviews",
          "description": "Verify that user access rights are reviewed at least quarterly for privileged accounts.",
          "test_procedure": "1. Obtain the access review policy. 2. Request evidence of completed reviews.",
          "expected_evidence": "Access review policy, completed review sign-offs",
          "framework_mapping": {"ISO 27001": "A.5.18", "COBIT": "DSS05.04", "PCI-DSS": "7.2.3"},
          "risk_weight": 4,
          "status": "partially_effective",
          "auditor_notes": "Semi-annual access reviews are conducted for standard accounts with 92% completion rate. However, privileged account reviews are not performed on a quarterly basis as required. Last privileged access review was 7 months ago.",
          "evidence_refs": ["EVD-010"],
          "tested_date": "2025-10-20",
          "tested_by": "Sarah Thompson, CISM"
        },
        {
          "control_id": "AC-007",
          "title": "Role-Based Access Control (RBAC)",
          "description": "Verify that access is granted through defined roles aligned to job functions.",
          "test_procedure": "1. Obtain role definition matrix. 2. Select 15 users and verify role assignments.",
          "expected_evidence": "RBAC matrix, IAM system role configuration",
          "framework_mapping": {"ISO 27001": "A.5.15", "COBIT": "DSS05.04", "PCI-DSS": "7.2.1"},
          "risk_weight": 4,
          "status": "effective",
          "auditor_notes": "Well-defined RBAC model implemented in Okta. 15 sampled users all had roles matching their job function. Role definitions documented and approved by business process owners. Minor finding: 2 users had roles from prior positions that were not removed during transfer.",
          "evidence_refs": ["EVD-011"],
          "tested_date": "2025-10-22",
          "tested_by": "Sarah Thompson, CISM"
        },
        {
          "control_id": "AC-008",
          "title": "Segregation of Duties (SoD)",
          "description": "Verify that access controls enforce segregation of incompatible duties.",
          "test_procedure": "1. Obtain SoD conflict matrix. 2. Run SoD conflict report.",
          "expected_evidence": "SoD conflict matrix, violation report",
          "framework_mapping": {"ISO 27001": "A.5.3", "COBIT": "DSS05.04", "SOX": "Section 404"},
          "risk_weight": 5,
          "status": "effective",
          "auditor_notes": "SoD matrix defined and enforced in the ERP system. No critical SoD violations identified. Two low-risk conflicts documented with compensating controls approved by the CFO.",
          "evidence_refs": ["EVD-012"],
          "tested_date": "2025-10-24",
          "tested_by": "Maria Chen, CISA, CRISC"
        }
      ],
      "findings": [
        {
          "finding_id": "FND-AC001",
          "title": "Privileged Accounts Lack Multi-Factor Authentication",
          "audit_area": "Access Control",
          "severity": "critical",
          "description": "Twelve domain administrator accounts and eight database administrator accounts do not enforce multi-factor authentication. The Oracle database management console uses legacy RADIUS authentication that supports password-only access, bypassing the organization's MFA controls. These accounts have direct access to production systems containing sensitive borrower data including SSNs and financial records.",
          "root_cause": "Legacy authentication infrastructure for the Oracle database management console does not support modern MFA protocols. The migration to a compatible authentication method was deprioritized due to competing project demands.",
          "business_impact": "Compromised privileged credentials could result in unauthorized access to all borrower records (approximately 2.3 million active records). Potential for regulatory sanctions under GLBA, state data breach notification requirements, and loss of customer trust. Estimated financial exposure: $5-15 million including breach notification costs, regulatory fines, and litigation.",
          "recommendation": "1. Implement MFA for all domain administrator accounts within 30 days using existing Okta integration. 2. Deploy a SAML-capable authentication proxy for the Oracle management console within 60 days. 3. Implement a PAM solution to enforce MFA checkout for all privileged sessions. 4. Disable legacy RADIUS authentication after migration.",
          "management_response": "Accepted. IT has initiated an emergency project to enable MFA for all domain admin accounts by January 15, 2026. Oracle console migration to SAML is scheduled for Q1 2026. PAM solution RFP issued November 2025.",
          "remediation_deadline": "2026-03-31",
          "risk_rating": {"likelihood": 4, "impact": 5, "score": 20, "severity": "critical", "rationale": "High likelihood due to credential reuse patterns observed in industry. Severe impact due to volume of PII accessible."},
          "related_controls": ["AC-004", "AC-005"],
          "evidence_refs": ["EVD-006", "EVD-007", "EVD-008"],
          "status": "open",
          "identified_date": "2025-10-16",
          "identified_by": "David Park, CISSP"
        },
        {
          "finding_id": "FND-AC002",
          "title": "Service Accounts Using Shared Credentials Without Rotation",
          "audit_area": "Access Control",
          "severity": "critical",
          "description": "Three production service accounts (svc_lending_app, svc_credit_check, svc_payment_proc) share the same password which has not been rotated in 14 months. These accounts have direct database access to loan application records containing PII. Credentials are stored in an encrypted spreadsheet accessible to 15 IT staff members without audit trail of access.",
          "root_cause": "No PAM solution in place. Service account password rotation was a manual process that was neglected after the responsible administrator departed. No automated monitoring for service account credential age.",
          "business_impact": "Shared credentials across three critical service accounts create a single point of compromise. Any of the 15 staff with spreadsheet access could use these credentials without attribution. Stale passwords increase vulnerability to brute force and credential stuffing attacks.",
          "recommendation": "1. Immediately rotate all three service account passwords to unique, complex credentials. 2. Implement a PAM solution with automated credential rotation (90-day maximum). 3. Restrict service account credentials to need-to-know basis. 4. Implement monitoring for service account interactive logon attempts.",
          "management_response": "Accepted. Service account passwords rotated on November 1, 2025. PAM solution implementation targeted for Q1 2026 as part of the broader privileged access project.",
          "remediation_deadline": "2026-02-28",
          "risk_rating": {"likelihood": 4, "impact": 5, "score": 20, "severity": "critical", "rationale": "High likelihood due to shared credentials and wide access. Severe impact due to direct database access to PII."},
          "related_controls": ["AC-005", "AC-009"],
          "evidence_refs": ["EVD-008", "EVD-009"],
          "status": "in_progress",
          "identified_date": "2025-10-18",
          "identified_by": "Maria Chen, CISA, CRISC"
        },
        {
          "finding_id": "FND-AC003",
          "title": "Delayed User De-Provisioning for Terminated Employees",
          "audit_area": "Access Control",
          "severity": "medium",
          "description": "Testing of 25 terminated employee accounts revealed that 3 accounts (12%) remained active for more than 5 business days after the termination date. The maximum delay observed was 8 business days. The de-provisioning SLA requires same-day deactivation for involuntary terminations and 3 business days for voluntary terminations.",
          "root_cause": "HR termination notification to IT relies on a manual email process. During peak periods, HR notification can be delayed by 2-3 business days. No automated integration between the HRIS and Active Directory for termination events.",
          "business_impact": "Active accounts for terminated employees create a window of unauthorized access risk, particularly for involuntary terminations where the departing employee may have motivation for malicious activity.",
          "recommendation": "1. Implement automated HRIS-to-AD integration for termination events using the existing SCIM connector. 2. Establish a daily reconciliation report comparing HR active employee list against AD active accounts. 3. Implement compensating control of immediate VPN and email suspension upon HR notification, prior to full de-provisioning.",
          "management_response": "Accepted. SCIM integration project approved and scheduled for Q1 2026. Daily reconciliation report implemented as interim control effective December 1, 2025.",
          "remediation_deadline": "2026-03-31",
          "risk_rating": {"likelihood": 3, "impact": 3, "score": 9, "severity": "medium", "rationale": "Moderate likelihood as delays are intermittent. Moderate impact limited to individual account access scope."},
          "related_controls": ["AC-002"],
          "evidence_refs": ["EVD-003", "EVD-004"],
          "status": "in_progress",
          "identified_date": "2025-10-12",
          "identified_by": "Maria Chen, CISA, CRISC"
        }
      ]
    },
    {
      "name": "Change Management",
      "description": "Controls for managing changes to IT systems, applications, and infrastructure.",
      "status": "completed",
      "auditor_assigned": "David Park, CISSP",
      "start_date": "2025-10-28",
      "completion_date": "2025-11-15",
      "compliance_pct": 75.0,
      "risk_score": 8.5,
      "notes": "Change process exists but segregation between development and production needs strengthening.",
      "controls": [
        {
          "control_id": "CM-001",
          "title": "Change Management Policy and Process",
          "description": "Verify that a formal change management policy exists.",
          "test_procedure": "1. Obtain the current change management policy.",
          "expected_evidence": "Change management policy document",
          "framework_mapping": {"ISO 27001": "A.8.32", "COBIT": "BAI06.01"},
          "risk_weight": 4,
          "status": "effective",
          "auditor_notes": "Comprehensive change management policy in place, approved by CTO in March 2025. Defines standard, normal, and emergency change categories.",
          "evidence_refs": ["EVD-020"],
          "tested_date": "2025-10-30",
          "tested_by": "David Park, CISSP"
        },
        {
          "control_id": "CM-003",
          "title": "Change Approval Authority",
          "description": "Verify that changes are approved by authorized personnel prior to implementation.",
          "test_procedure": "1. Review the approval authority matrix. 2. For sampled changes, verify approvals.",
          "expected_evidence": "Approval authority matrix, change tickets with approvals",
          "framework_mapping": {"ISO 27001": "A.8.32", "COBIT": "BAI06.01", "SOX": "Section 404"},
          "risk_weight": 5,
          "status": "partially_effective",
          "auditor_notes": "Approval authority matrix exists. 22 of 25 sampled changes had proper approval. 3 changes were deployed before formal approval was recorded in the ITSM tool. No formal CAB exists; approvals are handled by individual team leads.",
          "evidence_refs": ["EVD-021", "EVD-022"],
          "tested_date": "2025-11-03",
          "tested_by": "David Park, CISSP"
        },
        {
          "control_id": "CM-005",
          "title": "Segregation of Development and Production Environments",
          "description": "Verify that development, testing, and production environments are separated.",
          "test_procedure": "1. Review environment architecture. 2. Verify developer access to production.",
          "expected_evidence": "Environment architecture diagram, access control lists",
          "framework_mapping": {"ISO 27001": "A.8.31", "COBIT": "BAI03.05", "SOX": "Section 404"},
          "risk_weight": 5,
          "status": "partially_effective",
          "auditor_notes": "Separate AWS accounts for dev, staging, and production. However, 4 senior developers have IAM roles granting them direct write access to production S3 buckets and Lambda functions for 'emergency fixes.' These emergency accesses are not logged or reviewed.",
          "evidence_refs": ["EVD-023", "EVD-024"],
          "tested_date": "2025-11-07",
          "tested_by": "David Park, CISSP"
        },
        {
          "control_id": "CM-006",
          "title": "Emergency Change Procedures",
          "description": "Verify that a defined emergency change process exists.",
          "test_procedure": "1. Review the emergency change procedure. 2. Identify emergency changes in past 6 months.",
          "expected_evidence": "Emergency change procedure, emergency change tickets",
          "framework_mapping": {"ISO 27001": "A.8.32", "COBIT": "BAI06.02"},
          "risk_weight": 4,
          "status": "effective",
          "auditor_notes": "Emergency change procedure documented and followed. 8 emergency changes in the past 6 months (6.5% of total changes), all with documented post-implementation reviews. Acceptable ratio.",
          "evidence_refs": ["EVD-025"],
          "tested_date": "2025-11-10",
          "tested_by": "David Park, CISSP"
        }
      ],
      "findings": [
        {
          "finding_id": "FND-CM001",
          "title": "No Formal Change Advisory Board (CAB)",
          "audit_area": "Change Management",
          "severity": "medium",
          "description": "Changes to production systems are approved by individual team leads without a formal Change Advisory Board review process. High-risk and major changes do not receive multi-stakeholder review before implementation. Emergency changes bypass all approval workflows with only verbal authorization.",
          "root_cause": "The organization has grown rapidly from 50 to 200 IT staff in 18 months. The change management process has not scaled to match, retaining the informal approval structure suited to a smaller team.",
          "business_impact": "Without CAB review, high-risk changes may not receive adequate risk assessment from all affected stakeholders. This increases the probability of failed changes and unplanned downtime for the lending platform.",
          "recommendation": "1. Establish a formal CAB with representation from IT operations, security, application development, and business stakeholders. 2. Define CAB meeting cadence (weekly recommended). 3. Require CAB approval for all high-risk and major changes. 4. Implement a formal emergency change approval process with documented authorization.",
          "management_response": "Accepted. CAB charter drafted and scheduled for CTO approval by January 2026. Weekly CAB meetings to commence February 2026.",
          "remediation_deadline": "2026-02-28",
          "risk_rating": {"likelihood": 3, "impact": 3, "score": 9, "severity": "medium"},
          "related_controls": ["CM-003"],
          "evidence_refs": ["EVD-021"],
          "status": "open",
          "identified_date": "2025-11-03",
          "identified_by": "David Park, CISSP"
        },
        {
          "finding_id": "FND-CM002",
          "title": "Developers Retain Production Write Access",
          "audit_area": "Change Management",
          "severity": "high",
          "description": "Four senior developers have AWS IAM roles granting direct write access to production S3 buckets and Lambda functions. This access was provisioned for emergency fix capabilities but is not time-limited, monitored, or subject to regular review. Developers can modify production code without going through the CI/CD pipeline or change management process.",
          "root_cause": "IAM roles were created during a production incident 9 months ago and were not revoked after the incident was resolved. No process exists to review and revoke temporary elevated access.",
          "business_impact": "Developers with production write access can introduce unauthorized changes, potentially affecting the integrity of loan processing calculations and financial transactions. This also violates SOX segregation of duties requirements.",
          "recommendation": "1. Immediately revoke standing production write access from developer IAM roles. 2. Implement a just-in-time (JIT) access mechanism requiring approval and time limitation for emergency production access. 3. Enable CloudTrail logging and alerting for any direct production modifications. 4. Conduct a review of all changes made via these IAM roles in the past 9 months.",
          "management_response": "Accepted. Developer production access revoked on November 15, 2025. JIT access mechanism under evaluation.",
          "remediation_deadline": "2026-01-31",
          "risk_rating": {"likelihood": 4, "impact": 4, "score": 16, "severity": "high"},
          "related_controls": ["CM-005"],
          "evidence_refs": ["EVD-023", "EVD-024"],
          "status": "in_progress",
          "identified_date": "2025-11-07",
          "identified_by": "David Park, CISSP"
        }
      ]
    },
    {
      "name": "Data Backup and Recovery",
      "description": "Controls for data backup operations, integrity verification, and disaster recovery.",
      "status": "completed",
      "auditor_assigned": "Sarah Thompson, CISM",
      "start_date": "2025-11-10",
      "completion_date": "2025-11-28",
      "compliance_pct": 66.7,
      "risk_score": 10.0,
      "notes": "Backup execution is reliable but DR testing has not been conducted in the current fiscal year.",
      "controls": [
        {
          "control_id": "BK-001",
          "title": "Backup Policy and Strategy",
          "description": "Verify that a formal data backup policy exists.",
          "test_procedure": "1. Obtain the data backup policy. 2. Verify RPO/RTO alignment.",
          "expected_evidence": "Backup policy document, BIA",
          "framework_mapping": {"ISO 27001": "A.8.13", "COBIT": "DSS04.01"},
          "risk_weight": 5,
          "status": "effective",
          "auditor_notes": "Comprehensive backup policy in place. RPO of 1 hour for production databases, RTO of 4 hours for critical systems. Policy reviewed and approved in June 2025.",
          "evidence_refs": ["EVD-030"],
          "tested_date": "2025-11-12",
          "tested_by": "Sarah Thompson, CISM"
        },
        {
          "control_id": "BK-002",
          "title": "Backup Execution and Scheduling",
          "description": "Verify that backups are executed per defined schedule.",
          "test_procedure": "1. Obtain backup job schedules. 2. Review success/failure rates.",
          "expected_evidence": "Backup job logs, monitoring alerts",
          "framework_mapping": {"ISO 27001": "A.8.13", "COBIT": "DSS04.07"},
          "risk_weight": 5,
          "status": "effective",
          "auditor_notes": "Automated backup schedule in place. 30-day review shows 99.2% success rate (3 failures out of 378 jobs, all resolved within 4 hours). AWS Backup for cloud resources, Veeam for on-premises Oracle databases.",
          "evidence_refs": ["EVD-031", "EVD-032"],
          "tested_date": "2025-11-14",
          "tested_by": "Sarah Thompson, CISM"
        },
        {
          "control_id": "BK-008",
          "title": "Disaster Recovery Testing",
          "description": "Verify that the DRP is tested at least annually.",
          "test_procedure": "1. Obtain DR test results. 2. Verify RTO/RPO achievement.",
          "expected_evidence": "DR test plan and results",
          "framework_mapping": {"ISO 27001": "A.5.30", "COBIT": "DSS04.04"},
          "risk_weight": 5,
          "status": "ineffective",
          "auditor_notes": "Last full DR test was conducted in March 2024 (20 months ago). A tabletop exercise was conducted in September 2025 but no functional recovery test was performed. The March 2024 test revealed RTO of 6.5 hours against a 4-hour target, and remediation actions from that test are still partially outstanding.",
          "evidence_refs": ["EVD-033", "EVD-034"],
          "tested_date": "2025-11-20",
          "tested_by": "Sarah Thompson, CISM"
        }
      ],
      "findings": [
        {
          "finding_id": "FND-BK001",
          "title": "Disaster Recovery Plan Not Tested Within 12 Months",
          "audit_area": "Data Backup and Recovery",
          "severity": "high",
          "description": "The last full disaster recovery test was conducted in March 2024, exceeding the 12-month testing requirement by 8 months. The March 2024 test revealed that actual RTO was 6.5 hours against the 4-hour target, and several remediation items from that test remain outstanding. A tabletop exercise was conducted in September 2025 but does not constitute a functional recovery test.",
          "root_cause": "DR testing was postponed twice due to competing priorities (platform migration and a production incident). No mechanism exists to enforce DR testing deadlines, and DR testing is not tied to management KPIs.",
          "business_impact": "Without validated DR capability, the organization cannot confirm it can recover the lending platform within the defined RTO/RPO targets. In a disaster scenario, actual recovery time could significantly exceed targets, resulting in extended platform downtime and potential loss of in-flight loan applications.",
          "recommendation": "1. Schedule and execute a full DR recovery test within 60 days. 2. Address all outstanding remediation items from the March 2024 test before the next test. 3. Add DR testing completion as a management KPI. 4. Implement a compliance calendar with automated reminders for recurring obligations.",
          "management_response": "Accepted. Full DR test scheduled for February 2026. Outstanding remediation items assigned to infrastructure team lead with January 2026 deadline.",
          "remediation_deadline": "2026-02-28",
          "risk_rating": {"likelihood": 3, "impact": 5, "score": 15, "severity": "high"},
          "related_controls": ["BK-008"],
          "evidence_refs": ["EVD-033", "EVD-034"],
          "status": "open",
          "identified_date": "2025-11-20",
          "identified_by": "Sarah Thompson, CISM"
        },
        {
          "finding_id": "FND-BK002",
          "title": "Recovery Time Objective Not Achievable Based on Last Test",
          "audit_area": "Data Backup and Recovery",
          "severity": "medium",
          "description": "The March 2024 DR test demonstrated an actual recovery time of 6.5 hours for the lending platform, which exceeds the defined 4-hour RTO by 62.5%. The primary bottleneck was Oracle database restoration, which took 4 hours alone due to the database size (2.8 TB) and the restore process requiring manual intervention for tablespace recovery.",
          "root_cause": "Database has grown significantly since RTO targets were set. Restore procedures have not been optimized for the current database size. No incremental restore capability is in place.",
          "business_impact": "If a disaster occurs, the lending platform will be unavailable for at least 6.5 hours (and potentially longer given further database growth), exceeding the business commitment of 4-hour RTO.",
          "recommendation": "1. Re-evaluate RTO targets based on current infrastructure capabilities and business requirements. 2. Implement Oracle Data Guard for near-real-time database replication to reduce failover time. 3. Optimize restore procedures and consider incremental restore capabilities. 4. Validate revised RTO through testing.",
          "management_response": "Accepted. Oracle Data Guard implementation approved in the FY2026 infrastructure budget. RTO review meeting scheduled with business stakeholders for January 2026.",
          "remediation_deadline": "2026-06-30",
          "risk_rating": {"likelihood": 3, "impact": 4, "score": 12, "severity": "high"},
          "related_controls": ["BK-008", "BK-001"],
          "evidence_refs": ["EVD-034"],
          "status": "open",
          "identified_date": "2025-11-22",
          "identified_by": "Sarah Thompson, CISM"
        }
      ]
    }
  ],
  "evidence_inventory": [
    {
      "evidence_id": "EVD-001",
      "title": "User Provisioning Policy v3.2",
      "evidence_type": "policy",
      "description": "Formal user provisioning policy document covering account request, approval, and creation processes.",
      "source": "IT Governance SharePoint",
      "file_reference": "policies/IAM/User_Provisioning_Policy_v3.2.pdf",
      "collected_date": "2025-10-08",
      "collected_by": "Maria Chen, CISA, CRISC",
      "control_ref": "AC-001",
      "finding_ref": null,
      "notes": "Last reviewed and approved by CISO on 2025-03-15."
    },
    {
      "evidence_id": "EVD-002",
      "title": "Sample Access Request Forms (25 accounts)",
      "evidence_type": "document",
      "description": "ServiceNow access request tickets for 25 sampled user accounts created between April and September 2025.",
      "source": "ServiceNow ITSM Platform",
      "file_reference": "evidence/AC-001/access_request_samples.pdf",
      "collected_date": "2025-10-10",
      "collected_by": "Maria Chen, CISA, CRISC",
      "control_ref": "AC-001",
      "finding_ref": null,
      "notes": "All 25 requests had documented business justification and manager approval."
    },
    {
      "evidence_id": "EVD-003",
      "title": "HR Termination List (April-September 2025)",
      "evidence_type": "system_output",
      "description": "Export from Workday HRIS of all employee terminations during the 6-month audit period.",
      "source": "Workday HRIS",
      "file_reference": "evidence/AC-002/hr_termination_list.xlsx",
      "collected_date": "2025-10-11",
      "collected_by": "Maria Chen, CISA, CRISC",
      "control_ref": "AC-002",
      "finding_ref": "FND-AC003",
      "notes": "42 terminations during the period. 25 selected for sample testing."
    },
    {
      "evidence_id": "EVD-006",
      "title": "MFA Enrollment Report",
      "evidence_type": "system_output",
      "description": "Okta MFA enrollment status report showing all users and their MFA enrollment status.",
      "source": "Okta Identity Platform",
      "file_reference": "evidence/AC-004/mfa_enrollment_report.csv",
      "collected_date": "2025-10-15",
      "collected_by": "David Park, CISSP",
      "control_ref": "AC-004",
      "finding_ref": "FND-AC001",
      "notes": "Report shows 20 admin accounts without MFA enrollment."
    },
    {
      "evidence_id": "EVD-008",
      "title": "Privileged Account Inventory",
      "evidence_type": "document",
      "description": "Spreadsheet listing all privileged accounts with assigned owners, purpose, and last password change date.",
      "source": "IT Security Team",
      "file_reference": "evidence/AC-005/privileged_account_inventory.xlsx",
      "collected_date": "2025-10-17",
      "collected_by": "Maria Chen, CISA, CRISC",
      "control_ref": "AC-005",
      "finding_ref": "FND-AC002",
      "notes": "Inventory shows 3 service accounts with shared credentials, last rotated August 2024."
    },
    {
      "evidence_id": "EVD-023",
      "title": "AWS IAM Role Configuration for Developers",
      "evidence_type": "configuration",
      "description": "AWS IAM policy exports showing developer roles with production write permissions.",
      "source": "AWS IAM Console",
      "file_reference": "evidence/CM-005/developer_iam_roles.json",
      "collected_date": "2025-11-06",
      "collected_by": "David Park, CISSP",
      "control_ref": "CM-005",
      "finding_ref": "FND-CM002",
      "notes": "Four developer roles with s3:PutObject and lambda:UpdateFunctionCode on production resources."
    },
    {
      "evidence_id": "EVD-033",
      "title": "DR Test Report - March 2024",
      "evidence_type": "document",
      "description": "Full disaster recovery test report from March 2024 including test plan, execution results, and identified gaps.",
      "source": "IT Operations Team",
      "file_reference": "evidence/BK-008/dr_test_report_march2024.pdf",
      "collected_date": "2025-11-18",
      "collected_by": "Sarah Thompson, CISM",
      "control_ref": "BK-008",
      "finding_ref": "FND-BK001",
      "notes": "RTO achievement: 6.5 hours against 4-hour target. RPO achievement: 45 minutes against 1-hour target (met)."
    }
  ]
}
